feedly.club/frontend/models/PasswordResetRequestForm.php

    public function sendEmail()
    {
        /* @var $user User */
        $user = User::findOne([
            'status' => User::STATUS_ACTIVE,
            'email' => $this->email,
        ]);

        if (!$user) {
            return false;
        }

        if (!User::isPasswordResetTokenValid($user->password_reset_token)) {
            $user->generatePasswordResetToken();
            if (!$user->save()) {
---
SELECT * FROM `user` WHERE (`status`=10) AND (`email`='kritsada.swe@gmail.com')
UPDATE `user` SET `password_reset_token`='0lA61LEwrlyZxiQpCAaw_OGRpgVmdXhR_1470910951', `updated_at`=1470910951 WHERE `id`=1