feedly.club/frontend/models/ResetPasswordForm.php

    public function resetPassword()
    {
        $user = $this->_user;
        $user->setPassword($this->password);
        $user->removePasswordResetToken();

        return $user->save(false);
---
UPDATE `user` SET `password_hash`='$2y$13$F3UPfbeMcig8l68zBzvNQeXvYUDjq7PEj.xMqqa3JT2ULiedausMG', `password_reset_token`=NULL, `updated_at`=1470910996 WHERE `id`=1